<?xml version="1.0" ?>
<net name="frozen_inference_graph" version="10">
	<layers>
		<layer id="0" name="inputs" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 34"/>
			<output>
				<port id="0" names="inputs:0" precision="FP16">
					<dim>1</dim>
					<dim>34</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="model/reshape/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>34</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model/reshape/Shape:0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="model/reshape/strided_slice/stack" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="0" names="model/reshape/strided_slice/stack:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="model/reshape/strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="1" size="8"/>
			<output>
				<port id="0" names="model/reshape/strided_slice/stack_1:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="model/reshape/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="1" size="8"/>
			<output>
				<port id="0" names="model/reshape/strided_slice/stack_2:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="model/reshape/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="1"/>
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="model/reshape/strided_slice:0" precision="I32"/>
			</output>
		</layer>
		<layer id="6" name="model/reshape/Reshape/shape/Unsqueeze_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="model/reshape/Reshape/shape/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="model/reshape/Reshape/shape/Unsqueeze161" type="Const" version="opset1">
			<data element_type="i32" offset="16" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="model/reshape/Reshape/shape/Unsqueeze163" type="Const" version="opset1">
			<data element_type="i32" offset="20" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="model/reshape/Reshape/shape" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="model/reshape/Reshape/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model/reshape/Reshape/shape:0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="model/reshape/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>34</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/reshape/Reshape:0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="model/tf.__operators__.getitem/strided_slice/concat_begin15185382" type="Const" version="opset1">
			<data element_type="i64" offset="24" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="model/tf.__operators__.getitem/strided_slice/concat_end15225346" type="Const" version="opset1">
			<data element_type="i64" offset="24" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="model/tf.__operators__.getitem/strided_slice/concat_strides15265526" type="Const" version="opset1">
			<data element_type="i64" offset="48" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="model/tf.__operators__.getitem/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1" ellipsis_mask="0, 0, 0" end_mask="1, 1, 1" new_axis_mask="0, 0, 0" shrink_axis_mask="0, 0, 0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" names="model/tf.__operators__.getitem/strided_slice:0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="model/tf.compat.v1.gather/GatherV2/indices" type="Const" version="opset1">
			<data element_type="i32" offset="72" shape="" size="4"/>
			<output>
				<port id="0" names="model/tf.compat.v1.gather/GatherV2/indices:0" precision="I32"/>
			</output>
		</layer>
		<layer id="18" name="model/tf.compat.v1.gather/GatherV2/axis" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="" size="8"/>
			<output>
				<port id="0" names="model/tf.compat.v1.gather/GatherV2/axis:0" precision="I64"/>
			</output>
		</layer>
		<layer id="19" name="model/tf.compat.v1.gather/GatherV2" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="model/tf.compat.v1.gather/GatherV2:0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="model/tf.math.multiply/Mul/y" type="Const" version="opset1">
			<data element_type="f16" offset="76" shape="1, 1" size="2"/>
			<output>
				<port id="0" names="model/tf.math.multiply/Mul/y:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="model/tf.math.multiply/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.math.multiply/Mul:0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="model/tf.compat.v1.gather_1/GatherV2/indices" type="Const" version="opset1">
			<data element_type="i32" offset="78" shape="" size="4"/>
			<output>
				<port id="0" names="model/tf.compat.v1.gather_1/GatherV2/indices:0" precision="I32"/>
			</output>
		</layer>
		<layer id="23" name="model/tf.compat.v1.gather_1/GatherV2/axis" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="" size="8"/>
			<output>
				<port id="0" names="model/tf.compat.v1.gather_1/GatherV2/axis:0" precision="I64"/>
			</output>
		</layer>
		<layer id="24" name="model/tf.compat.v1.gather_1/GatherV2" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="model/tf.compat.v1.gather_1/GatherV2:0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="model/tf.math.multiply_1/Mul/y" type="Const" version="opset1">
			<data element_type="f16" offset="76" shape="1, 1" size="2"/>
			<output>
				<port id="0" names="model/tf.math.multiply_1/Mul/y:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="model/tf.math.multiply_1/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.math.multiply_1/Mul:0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="model/tf.__operators__.add/AddV2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.__operators__.add/AddV2:0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="model/tf.expand_dims/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="1" size="8"/>
			<output>
				<port id="0" names="model/tf.expand_dims/ExpandDims/dim:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="model/tf.expand_dims/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.expand_dims/ExpandDims:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="model/tf.compat.v1.size/Size/Shape/" type="ShapeOf" version="opset3">
			<data output_type="i32"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="model/tf.compat.v1.size/Size/Shape/ReduceProd//value" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="model/tf.compat.v1.size/Size" type="ReduceProd" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.compat.v1.size/Size:0" precision="I32"/>
			</output>
		</layer>
		<layer id="33" name="model/tf.compat.v1.floor_div/FloorDiv/y" type="Const" version="opset1">
			<data element_type="i32" offset="82" shape="" size="4"/>
			<output>
				<port id="0" names="model/tf.compat.v1.floor_div/FloorDiv/y:0" precision="I32"/>
			</output>
		</layer>
		<layer id="34" name="model/tf.compat.v1.floor_div/FloorDiv/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<input>
				<port id="0" precision="I32"/>
				<port id="1" precision="I32"/>
			</input>
			<output>
				<port id="2" precision="I32"/>
			</output>
		</layer>
		<layer id="35" name="model/tf.compat.v1.floor_div/FloorDiv" type="Floor" version="opset1">
			<input>
				<port id="0" precision="I32"/>
			</input>
			<output>
				<port id="1" names="model/tf.compat.v1.floor_div/FloorDiv:0" precision="I32"/>
			</output>
		</layer>
		<layer id="36" name="model/tf.broadcast_to/BroadcastTo/shape/Unsqueeze_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="model/tf.broadcast_to/BroadcastTo/shape/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="model/tf.broadcast_to/BroadcastTo/shape/Unsqueeze154" type="Const" version="opset1">
			<data element_type="i32" offset="16" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="model/tf.broadcast_to/BroadcastTo/shape/Unsqueeze156" type="Const" version="opset1">
			<data element_type="i32" offset="20" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="model/tf.broadcast_to/BroadcastTo/shape" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="model/tf.broadcast_to/BroadcastTo/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model/tf.broadcast_to/BroadcastTo/shape:0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="model/tf.broadcast_to/BroadcastTo" type="Broadcast" version="opset3">
			<data mode="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="model/tf.math.subtract/Sub/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.math.subtract/Sub:0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="model/tf.compat.v1.gather_4/GatherV2/indices" type="Const" version="opset1">
			<data element_type="i32" offset="86" shape="" size="4"/>
			<output>
				<port id="0" names="model/tf.compat.v1.gather_4/GatherV2/indices:0" precision="I32"/>
			</output>
		</layer>
		<layer id="45" name="model/tf.compat.v1.gather_4/GatherV2/axis" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="" size="8"/>
			<output>
				<port id="0" names="model/tf.compat.v1.gather_4/GatherV2/axis:0" precision="I64"/>
			</output>
		</layer>
		<layer id="46" name="model/tf.compat.v1.gather_4/GatherV2" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="model/tf.compat.v1.gather_4/GatherV2:0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="model/tf.math.multiply_4/Mul/y" type="Const" version="opset1">
			<data element_type="f16" offset="76" shape="1, 1" size="2"/>
			<output>
				<port id="0" names="model/tf.math.multiply_4/Mul/y:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="model/tf.math.multiply_4/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.math.multiply_4/Mul:0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="model/tf.compat.v1.gather_5/GatherV2/indices" type="Const" version="opset1">
			<data element_type="i32" offset="90" shape="" size="4"/>
			<output>
				<port id="0" names="model/tf.compat.v1.gather_5/GatherV2/indices:0" precision="I32"/>
			</output>
		</layer>
		<layer id="50" name="model/tf.compat.v1.gather_5/GatherV2/axis" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="" size="8"/>
			<output>
				<port id="0" names="model/tf.compat.v1.gather_5/GatherV2/axis:0" precision="I64"/>
			</output>
		</layer>
		<layer id="51" name="model/tf.compat.v1.gather_5/GatherV2" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="model/tf.compat.v1.gather_5/GatherV2:0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="model/tf.math.multiply_5/Mul/y" type="Const" version="opset1">
			<data element_type="f16" offset="76" shape="1, 1" size="2"/>
			<output>
				<port id="0" names="model/tf.math.multiply_5/Mul/y:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="model/tf.math.multiply_5/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.math.multiply_5/Mul:0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="model/tf.__operators__.add_2/AddV2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.__operators__.add_2/AddV2:0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="model/tf.compat.v1.gather_2/GatherV2/indices" type="Const" version="opset1">
			<data element_type="i32" offset="72" shape="" size="4"/>
			<output>
				<port id="0" names="model/tf.compat.v1.gather_2/GatherV2/indices:0" precision="I32"/>
			</output>
		</layer>
		<layer id="56" name="model/tf.compat.v1.gather_2/GatherV2/axis" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="" size="8"/>
			<output>
				<port id="0" names="model/tf.compat.v1.gather_2/GatherV2/axis:0" precision="I64"/>
			</output>
		</layer>
		<layer id="57" name="model/tf.compat.v1.gather_2/GatherV2" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="model/tf.compat.v1.gather_2/GatherV2:0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="model/tf.math.multiply_2/Mul/y" type="Const" version="opset1">
			<data element_type="f16" offset="76" shape="1, 1" size="2"/>
			<output>
				<port id="0" names="model/tf.math.multiply_2/Mul/y:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="model/tf.math.multiply_2/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.math.multiply_2/Mul:0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="model/tf.compat.v1.gather_3/GatherV2/indices" type="Const" version="opset1">
			<data element_type="i32" offset="78" shape="" size="4"/>
			<output>
				<port id="0" names="model/tf.compat.v1.gather_3/GatherV2/indices:0" precision="I32"/>
			</output>
		</layer>
		<layer id="61" name="model/tf.compat.v1.gather_3/GatherV2/axis" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="" size="8"/>
			<output>
				<port id="0" names="model/tf.compat.v1.gather_3/GatherV2/axis:0" precision="I64"/>
			</output>
		</layer>
		<layer id="62" name="model/tf.compat.v1.gather_3/GatherV2" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="model/tf.compat.v1.gather_3/GatherV2:0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="model/tf.math.multiply_3/Mul/y" type="Const" version="opset1">
			<data element_type="f16" offset="76" shape="1, 1" size="2"/>
			<output>
				<port id="0" names="model/tf.math.multiply_3/Mul/y:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="model/tf.math.multiply_3/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.math.multiply_3/Mul:0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="model/tf.__operators__.add_1/AddV2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="model/tf.math.subtract_1/Sub/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.math.subtract_1/Sub:0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="model/tf.compat.v1.norm/norm/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.compat.v1.norm/norm/mul:0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="model/tf.compat.v1.norm/norm/Const" type="Const" version="opset1">
			<data element_type="i64" offset="94" shape="2" size="16"/>
			<output>
				<port id="0" names="model/tf.compat.v1.norm/norm/Const:0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="model/tf.compat.v1.norm/norm/Sum" type="ReduceSum" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="136" type="Const" version="opset1">
			<data element_type="f16" offset="76" shape="1, 1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="model/tf.compat.v1.norm/norm/Sqrt/pow_" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.compat.v1.norm/norm/Sqrt:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="model/tf.compat.v1.norm/norm/Squeeze/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="94" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="model/tf.compat.v1.norm/norm/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.compat.v1.norm/norm/Squeeze:0" precision="FP16"/>
			</output>
		</layer>
		<layer id="74" name="model/tf.math.multiply_8/Mul/y" type="Const" version="opset1">
			<data element_type="f16" offset="110" shape="" size="2"/>
			<output>
				<port id="0" names="model/tf.math.multiply_8/Mul/y:0" precision="FP16"/>
			</output>
		</layer>
		<layer id="75" name="model/tf.math.multiply_8/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16"/>
				<port id="1" precision="FP16"/>
			</input>
			<output>
				<port id="2" names="model/tf.math.multiply_8/Mul:0" precision="FP16"/>
			</output>
		</layer>
		<layer id="76" name="model/tf.compat.v1.gather_6/GatherV2/indices" type="Const" version="opset1">
			<data element_type="i32" offset="72" shape="" size="4"/>
			<output>
				<port id="0" names="model/tf.compat.v1.gather_6/GatherV2/indices:0" precision="I32"/>
			</output>
		</layer>
		<layer id="77" name="model/tf.compat.v1.gather_6/GatherV2/axis" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="" size="8"/>
			<output>
				<port id="0" names="model/tf.compat.v1.gather_6/GatherV2/axis:0" precision="I64"/>
			</output>
		</layer>
		<layer id="78" name="model/tf.compat.v1.gather_6/GatherV2" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="model/tf.compat.v1.gather_6/GatherV2:0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="model/tf.math.multiply_6/Mul/y" type="Const" version="opset1">
			<data element_type="f16" offset="76" shape="1, 1" size="2"/>
			<output>
				<port id="0" names="model/tf.math.multiply_6/Mul/y:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="model/tf.math.multiply_6/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.math.multiply_6/Mul:0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="model/tf.compat.v1.gather_7/GatherV2/indices" type="Const" version="opset1">
			<data element_type="i32" offset="78" shape="" size="4"/>
			<output>
				<port id="0" names="model/tf.compat.v1.gather_7/GatherV2/indices:0" precision="I32"/>
			</output>
		</layer>
		<layer id="82" name="model/tf.compat.v1.gather_7/GatherV2/axis" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="" size="8"/>
			<output>
				<port id="0" names="model/tf.compat.v1.gather_7/GatherV2/axis:0" precision="I64"/>
			</output>
		</layer>
		<layer id="83" name="model/tf.compat.v1.gather_7/GatherV2" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="model/tf.compat.v1.gather_7/GatherV2:0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="model/tf.math.multiply_7/Mul/y" type="Const" version="opset1">
			<data element_type="f16" offset="76" shape="1, 1" size="2"/>
			<output>
				<port id="0" names="model/tf.math.multiply_7/Mul/y:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="model/tf.math.multiply_7/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.math.multiply_7/Mul:0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="model/tf.__operators__.add_3/AddV2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.__operators__.add_3/AddV2:0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="model/tf.expand_dims_1/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="1" size="8"/>
			<output>
				<port id="0" names="model/tf.expand_dims_1/ExpandDims/dim:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="model/tf.expand_dims_1/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.expand_dims_1/ExpandDims:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="model/tf.compat.v1.size_1/Size/Shape/" type="ShapeOf" version="opset3">
			<data output_type="i32"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="model/tf.compat.v1.size_1/Size/Shape/ReduceProd//value" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="model/tf.compat.v1.size_1/Size" type="ReduceProd" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.compat.v1.size_1/Size:0" precision="I32"/>
			</output>
		</layer>
		<layer id="92" name="model/tf.compat.v1.floor_div_1/FloorDiv/y" type="Const" version="opset1">
			<data element_type="i32" offset="82" shape="" size="4"/>
			<output>
				<port id="0" names="model/tf.compat.v1.floor_div_1/FloorDiv/y:0" precision="I32"/>
			</output>
		</layer>
		<layer id="93" name="model/tf.compat.v1.floor_div_1/FloorDiv/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<input>
				<port id="0" precision="I32"/>
				<port id="1" precision="I32"/>
			</input>
			<output>
				<port id="2" precision="I32"/>
			</output>
		</layer>
		<layer id="94" name="model/tf.compat.v1.floor_div_1/FloorDiv" type="Floor" version="opset1">
			<input>
				<port id="0" precision="I32"/>
			</input>
			<output>
				<port id="1" names="model/tf.compat.v1.floor_div_1/FloorDiv:0" precision="I32"/>
			</output>
		</layer>
		<layer id="95" name="model/tf.broadcast_to_1/BroadcastTo/shape/Unsqueeze_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="model/tf.broadcast_to_1/BroadcastTo/shape/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="model/tf.broadcast_to_1/BroadcastTo/shape/Unsqueeze147" type="Const" version="opset1">
			<data element_type="i32" offset="16" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="model/tf.broadcast_to_1/BroadcastTo/shape/Unsqueeze149" type="Const" version="opset1">
			<data element_type="i32" offset="20" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="model/tf.broadcast_to_1/BroadcastTo/shape" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="model/tf.broadcast_to_1/BroadcastTo/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model/tf.broadcast_to_1/BroadcastTo/shape:0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="model/tf.broadcast_to_1/BroadcastTo" type="Broadcast" version="opset3">
			<data mode="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="model/tf.math.subtract_2/Sub/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.math.subtract_2/Sub:0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="model/tf.compat.v1.gather_8/GatherV2/indices" type="Const" version="opset1">
			<data element_type="i32" offset="112" shape="" size="4"/>
			<output>
				<port id="0" names="model/tf.compat.v1.gather_8/GatherV2/indices:0" precision="I32"/>
			</output>
		</layer>
		<layer id="104" name="model/tf.compat.v1.gather_8/GatherV2/axis" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="" size="8"/>
			<output>
				<port id="0" names="model/tf.compat.v1.gather_8/GatherV2/axis:0" precision="I64"/>
			</output>
		</layer>
		<layer id="105" name="model/tf.compat.v1.gather_8/GatherV2" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="model/tf.compat.v1.gather_8/GatherV2:0" precision="FP16">
					<dim>17</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="model/tf.compat.v1.norm_1/norm/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>17</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>17</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.compat.v1.norm_1/norm/mul:0" precision="FP16">
					<dim>17</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="model/tf.compat.v1.norm_1/norm/Sum/reduction_indices" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="0" names="model/tf.compat.v1.norm_1/norm/Sum/reduction_indices:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="model/tf.compat.v1.norm_1/norm/Sum" type="ReduceSum" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>17</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="138" type="Const" version="opset1">
			<data element_type="f16" offset="76" shape="1, 1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="model/tf.compat.v1.norm_1/norm/Sqrt/pow_" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.compat.v1.norm_1/norm/Sqrt:0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="model/tf.compat.v1.norm_1/norm/Squeeze/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="model/tf.compat.v1.norm_1/norm/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.compat.v1.norm_1/norm/Squeeze:0" precision="FP16">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="model/tf.math.reduce_max/Const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="0" names="model/tf.math.reduce_max/Const:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="model/tf.math.reduce_max/Max" type="ReduceMax" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.math.reduce_max/Max:0" precision="FP16"/>
			</output>
		</layer>
		<layer id="115" name="model/tf.math.maximum/Maximum" type="Maximum" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16"/>
				<port id="1" precision="FP16"/>
			</input>
			<output>
				<port id="2" precision="FP16"/>
			</output>
		</layer>
		<layer id="116" name="model/tf.math.truediv/truediv/reciprocal__input_port_1/value19995517" type="Const" version="opset1">
			<data element_type="f16" offset="116" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="117" name="model/tf.math.truediv/truediv/reciprocal_" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16"/>
				<port id="1" precision="FP16"/>
			</input>
			<output>
				<port id="2" precision="FP16"/>
			</output>
		</layer>
		<layer id="118" name="model/tf.math.truediv/truediv/reciprocal_/EltwiseUnsqueeze_input_port_1/value22835490" type="Const" version="opset1">
			<data element_type="i64" offset="118" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="model/tf.math.truediv/truediv/reciprocal_/EltwiseUnsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP16"/>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.math.maximum/Maximum:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="model/tf.math.truediv/truediv" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/tf.math.truediv/truediv:0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="model/flatten/Const" type="Const" version="opset1">
			<data element_type="i64" offset="142" shape="2" size="16"/>
			<output>
				<port id="0" names="model/flatten/Const:0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="model/flatten/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>17</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/flatten/Reshape:0" precision="FP16">
					<dim>1</dim>
					<dim>34</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="model/dense/MatMul/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="158" shape="128, 34" size="8704"/>
			<output>
				<port id="0" names="model/dense/MatMul/ReadVariableOp:0" precision="FP16">
					<dim>128</dim>
					<dim>34</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="model/dense/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>34</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>34</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/dense/MatMul:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="model/dense/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="8862" shape="1, 128" size="256"/>
			<output>
				<port id="0" names="model/dense/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="model/dense/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/dense/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="model/dense/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model/dense/Relu6:0,model/dropout/Identity:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="model/dense_1/MatMul/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="9118" shape="64, 128" size="16384"/>
			<output>
				<port id="0" names="model/dense_1/MatMul/ReadVariableOp:0" precision="FP16">
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="model/dense_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/dense_1/MatMul:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="model/dense_1/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="25502" shape="1, 64" size="128"/>
			<output>
				<port id="0" names="model/dense_1/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="model/dense_1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/dense_1/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="model/dense_1/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" names="model/dense_1/Relu6:0,model/dropout_1/Identity:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="model/dense_2/MatMul/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="25630" shape="13, 64" size="1664"/>
			<output>
				<port id="0" names="model/dense_2/MatMul/ReadVariableOp:0" precision="FP16">
					<dim>13</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="model/dense_2/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>13</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/dense_2/MatMul:0" precision="FP16">
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="model/dense_2/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="27294" shape="1, 13" size="26"/>
			<output>
				<port id="0" names="model/dense_2/BiasAdd/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="model/dense_2/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model/dense_2/BiasAdd:0" precision="FP16">
					<dim>1</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="model/dense_2/Softmax" type="SoftMax" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
